#include <stdio.h>

int main(void) {
    char n;
    printf("Введите размер улитки (от 1 до 10): ");
    if (scanf("%d", &n) != 1 || n < 1 || n > 10) {
        printf("Некорректный размер улитки.\n");
        return 0;
    }

    char m[n][n];
    char c = 1;  // начальное значение для заполнения
    char l = 0, r = n - 1, t = 0, b = n - 1;
    
    while (c <= n * n) { //заполнение массива/матрицы змейкой
        
        for (int j = l; j <= r; j++) m[t][j] = c++; //заполняем верхнюю строку слева направо
        t++;  //сдвиг верх границы
        for (int i = t; i <= b; i++) m[i][r] = c++; //заполняем правый столбец сверху вниз
        r--;  //сдвиг прав границы
        for (int j = r; j >= l; j--) m[b][j] = c++;//заполняем нижнюю строку справа налево
        b--;  //сдвиг ниж границы
        for (int i = b; i >= t; i--) m[i][l] = c++;//заполняем левый столбец снизу вверх
        l++;  //сдвиг лев границы
    }

    printf("Полученная улитка %dx%d:\n", n, n); //вывод улитки
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            printf("%4d ", m[i][j]);
        }
        printf("\n");
    }

    return 0;
}
